Repository: AlbertoCasasOrtiz/kls-mcmarr
Catalog: kls_mcmarr/locales/*/LC_MESSAGES/messages.po
Languages: es

# required-body-parts-not-detected
source: Some of the required body parts were not detected
es: Alguna de las partes del cuerpo requeridas no se detectó

source: Initial position
es: Posición inicial

# stage-not-finished
source: %(stage_name)s not finished
es: %(stage_name)s no terminó

# body-part-never-moved-pos
source: The %(body_part)s never moved towards the %(pos)s
es: El/la %(body_part)s nunca se movió hacia la posición %(pos)s

source: wrist
es: muñeca

source: right
es: derecha

# ending-position-never-reached
source: Ending position was never reached
es: Nunca se alcanzó la posición final

# transition-name
source: Transition %(name)s
es: Transición %(name)s

# error-reaching-last-frame
source: There was an error reaching the last frame
es: Hubo un error al intentar llegar al último fotograma

# body-part-not-pos-reference
source: The %(body_part)s not at %(pos)s of the %(reference)s
es: El/la %(body_part)s no está a la posición %(pos)s de el/la %(reference)s

source: above
es: encima de

source: shoulder
es: hombro

source: at left
es: a la izquierda

source: elbow
es: codo

source: below
es: debajo de

# body-part-not-following-trajectory
source: The %(body_part)s is not following a %(trajectory_type)s trajectory
es: El/la %(body_part)s no está siguiendo una trayectoria %(trajectory_type)s

source: clockwise
es: en el sentido de las agujas del reloj

# body-part-not-anchored
source: The %(body_part)s was not anchored to the body
es: El/la %(body_part)s no está anclado al cuerpo

# body-parts-not-same-line
source: The %(body_part_1)s and the %(body_part_2)s are not in the same %(line_type)s line
es: El/la %(body_part_1)s y el/la %(body_part_2)s no están en la misma línea %(line_type)s

# body-part-far-from-reference
source: The %(body_part)s is too far from %(reference)s
es: El/la %(body_part)s está demasiado alejado de el/la %(reference)s

source: hip
es: cadera

source: Ending position
es: Posición final

# body-part-not-distance-body-part
source: The %(body_part_1)s is not at approximately %(distance)s of distance of the %(body_part_2)s
es: El/la %(body_part_1)s no está a aproximadamente la distancia de %(distance)s de el/la %(body_part_2)s

source: body
es: cuerpo

source: one punch
es: un puño

# movement-not-detected-or-defined
source: The movement was not detected or has not been defined
es: El movimiento no se detectó o no está definido

source: left
es: izquierda

# body-part-never-surpassed-reference
source: The %(body_part)s never surpassed the %(reference)s
es: El/la %(body_part)s nunca sobrepasó el/la %(reference)s

# body-part-not-in-reference
source: The %(body_part)s is not in the %(reference)s
es: El/la %(body_part)s no está en el/la %(reference)s

source: center of body
es: centro del cuerpo

source: rectilinear
es: rectilínea

source: down and away from center body
es: abajo y alejado del centro del cuerpo

# body-part-never-pos-relative-to
source: The %(body_part)s never was %(pos)s the %(reference_part)s
es: El/la %(body_part)s nunca estuvo a la posición %(pos)s de el/la %(reference_part)s

# horizontal-line-eyes
source: horizontal line of the eyes
es: línea horizontal de los ojos

source: down
es: abajo

source: head
es: cabeza

source: ear
es: oreja

# body-part-not-crossing-reference
source: The %(body_part)s is not crossing the %(reference)s
es: El/la %(body_part)s no está cruzando el/la %(reference)s

source: nose
es: nariz

# body-part-beyond-reference
source: The %(body_part)s is beyond the %(reference)s
es: El/la %(body_part)s está mas alla de el/la %(reference)s

source: solar plexus
es: plexo solar

# body-part-never-pos-reference
source: The %(body_part)s never went %(pos)s the %(reference)s
es: El/la %(body_part)s nunca fue a la posición %(pos)s de el/la %(reference)s

source: inside
es: dentro

source: plexus
es: plexo

# body-part-never-stopped-going-pos
source: The %(body_part)s never stopped going %(pos)s
es: El/la %(body_part)s nunca paró de ir hacia la posición %(pos)s

source: up
es: arriba

# body-part-not-going-pos
source: The %(body_part)s is not going %(pos)s
es: El/la %(body_part)s no está yendo hacia la posición %(pos)s

# please-execute-movement
source: Please, execute the movement %(movement)s
es: Por favor, ejecuta el movimiento %(movement)s

source: Psychomotor Module
es: Módulo Psicomotor

source: Iteration
es: Iteración

source: Movement Name
es: Nombre del Movimiento

source: Errors
es: Errores

source: Priority
es: Prioridad

source: No errors
es: Sin errores

source: Cognitive Module
es: Módulo Cognitivo

source: Affective Module
es: Módulo Afectivo

# affective_main_emotion
source: Main Emotion
es: Emocion Principal

# commited-mild-medium-errors
source: You have committed %(num_mild)s mild errors and %(num_medium)s medium errors
es: Has cometido %(num_mild)s errores leves y %(num_medium)s errores moderados

source: Let's continue
es: Continuemos

# commited-mild-errors
source: You have committed %(num_mild)s mild errors
es: Has cometido %(num_mild)s errores leves

# commited-medium-errors
source: You have committed %(num_medium)s medium errors
es: Has cometido %(num_medium)s errores moderados

# commited-errors
source: You have committed %(num_errors)s errors
es: Has cometido %(num_errors)s errores

# b1e1
source: At the beginning of the movement, your fist should move toward the center of your body.
es: Al comenzar el movimiento, tu puño debe moverse hacia el centro de tu cuerpo.

# b1e2
source: Your fist should rise up through the center of your body until it reaches above your head.
es: Tu puño debe subir por el centro del cuerpo, hasta llegar encima de tu cabeza.

# b1e3
source: When your arm is covering your head, it should remain in that position.
es: Cuando tu brazo esté cubriendo tu cabeza, tiene que mantenerse en esa posición.

# b1e4
source: Your fist should rise up through the center of your body.
es: Tu puño debe subir por el centro de tu cuerpo.

# b1e5
source: You should fully cover your head. In the final position, move your fist further to your left.
es: Debes cubrir bien tu cabeza. En la posición final, mueve tu puño más hacia tu izquierda.

# b2e1
source: Your fist should move toward your left shoulder.
es: Tu puño debe dirigirse hacia tu hombro izquierdo.

# b2e2
source: Your fist should end up below the horizontal line of your eyes.
es: Tu puño debe terminar por debajo de la horizontal de tus ojos.

# b2e3
source: Your fist should move in a straight line toward your shoulder.
es: Tu puño debe moverse en línea recta hacia tu hombro.

# b3e1
source: You should move the fist to your right in a straight line.
es: Debes mover el puño hacia tu derecha en línea recta.

# b3e2
source: You should move your fist further to the right.
es: Debes mover tu puño más hacia la derecha.

# b3e3
source: Your fist should move in a straight line.
es: Tu puño debe moverse en línea recta.

# b4e1
source: At the beginning of the movement, your fist should move toward the center of your body.
es: Al inicio del movimiento, tu puño debe dirigirse hacia el centro del cuerpo.

# b4e2
source: When your fist reaches the bottom, it should be aligned with your elbow.
es: Cuando tu puño llegue abajo, debe estar alineado con el codo.

# b4e3
source: Your fist should move in a counterclockwise circle.
es: Tu puño debe moverse siguiendo un círculo en el sentido contrario a las agujas del reloj.
